package jp.co.monolithworks.il.iris;

import java.util.Map;
import java.util.HashMap;

public class ConsumeLimit{

    public static String[][] limit;

    public ConsumeLimit(){

        setLimitday();
    }

    private void setLimitday(){

        limit = new String[][]{
            {"トマト","１４"}
            ,{"キュウリ","２"}
            ,{"タマネギ","１４"}
            ,{"ナス","２"}
            ,{"ニンジン","５"}//冬なら1週間としか書いてありませんでした。
            ,{"ジャガイモ","３０"}
            ,{"ダイコン","１０"}
            ,{"キャベツ","１４"}
            ,{"レタス","４"}
            ,{"ホウレンソウ","７"}
            ,{"ピーマン","７"}
            ,{"バナナ","７"}
            ,{"リンゴ","３０"}
            ,{"イチゴ","４"}
            ,{"ブドウ","１４"}
            ,{"キウイフルーツ","７"}//1~2週間
            ,{"シイタケ","６"}
            ,{"生クリーム","９０"}
            ,{"マーガリン","１８０"}
            ,{"ヨーグルト","１４"}//プルーン
            ,{"バター","１８０"}
            ,{"チーズ","４"}//開封後
            ,{"牛乳","７"}
            ,{"パックジュース","１５"}
            ,{"ビール","２７０"}
            ,{"冷凍食品","３６５"}
            ,{"マヨネーズ","９０"}
            ,{"ケチャップ","５５０"}
            ,{"肉","２"}
            ,{"魚","４"}};
    }
}
